unit ZCnDate;

interface

uses Windows, SysUtils, Controls;

const
  START_YEAR=1901;
  END_YEAR=2050;
  //农历月份数据，每年4字节，从1901年开始，共150年
  //数据解析：
  //如果第一字节的bit7为1，则该年1月1日位于农历12月，否则位于11月
  //第一字节去除bit7为该年1月1日的农历日期
  //        第二字节                第三字节
  //bit:    7  6  5  4  3  2  1  0  7  6  5  4  3  2  1  0
  //农历月份:16 15 14 13 12 11 10 9  8  7  6  5  4  3  2  1
  //农历月份指的是从该年1月1日的农历月份算起的顺序号
  //农历月份对应的bit为1则该月为30日，否则为29日
  //第四字节为闰月月份
  CnData: array[0..599] of Byte = (
    $0b,$52,$ba,$00,   $16,$a9,$5d,$00,   $83,$a9,$37,$05,   $0e,$74,$9b,$00,
    $1a,$b6,$55,$00,   $87,$b5,$55,$04,   $11,$55,$aa,$00,   $1c,$a6,$b5,$00,
    $8a,$a5,$75,$02,   $14,$52,$ba,$00,   $81,$52,$6e,$06,   $0d,$e9,$37,$00,
    $18,$74,$97,$00,   $86,$ea,$96,$05,   $10,$6d,$55,$00,   $1a,$35,$aa,$00,
    $88,$4b,$6a,$02,   $13,$a5,$6d,$00,   $1e,$d2,$6e,$07,   $0b,$d2,$5e,$00,
    $17,$e9,$2e,$00,   $84,$d9,$2d,$05,   $0f,$da,$95,$00,   $19,$5b,$52,$00,
    $87,$56,$d4,$04,   $11,$4a,$da,$00,   $1c,$a5,$5d,$00,   $89,$a4,$bd,$02,
    $15,$d2,$5d,$00,   $82,$b2,$5b,$06,   $0d,$b5,$2b,$00,   $18,$ba,$95,$00,
    $86,$b6,$a5,$05,   $10,$56,$b4,$00,   $1a,$4a,$da,$00,   $87,$49,$ba,$03,
    $13,$a4,$bb,$00,   $1e,$b2,$5b,$07,   $0b,$72,$57,$00,   $16,$75,$2b,$00,
    $84,$6d,$2a,$06,   $0f,$ad,$55,$00,   $19,$55,$aa,$00,   $86,$55,$6c,$04,
    $12,$c9,$76,$00,   $1c,$64,$b7,$00,   $8a,$e4,$ae,$02,   $15,$ea,$56,$00,
    $83,$da,$55,$07,   $0d,$5b,$2a,$00,   $18,$ad,$55,$00,   $85,$aa,$d5,$05,
    $10,$53,$6a,$00,   $1b,$a9,$6d,$00,   $88,$a9,$5d,$03,   $13,$d4,$ae,$00,
    $81,$d4,$ab,$08,   $0c,$ba,$55,$00,   $16,$5a,$aa,$00,   $83,$56,$aa,$06,
    $0f,$aa,$d5,$00,   $19,$52,$da,$00,   $86,$52,$ba,$04,   $11,$a9,$5d,$00,
    $1d,$d4,$9b,$00,   $8a,$74,$9b,$03,   $15,$b6,$55,$00,   $82,$ad,$55,$07,
    $0d,$55,$aa,$00,   $18,$a5,$b5,$00,   $85,$a5,$75,$05,   $0f,$52,$b6,$00,
    $1b,$69,$37,$00,   $89,$e9,$37,$04,   $13,$74,$97,$00,   $81,$ea,$96,$08,
    $0c,$6d,$52,$00,   $16,$2d,$aa,$00,   $83,$4b,$6a,$06,   $0e,$a5,$6d,$00,
    $1a,$d2,$6e,$00,   $87,$d2,$5e,$04,   $12,$e9,$2e,$00,   $1d,$ec,$96,$0a,
    $0b,$da,$95,$00,   $15,$5b,$52,$00,   $82,$56,$d2,$06,   $0c,$2a,$da,$00,
    $18,$a4,$dd,$00,   $85,$a4,$bd,$05,   $10,$d2,$5d,$00,   $1b,$d9,$2d,$00,
    $89,$b5,$2b,$03,   $14,$ba,$95,$00,   $81,$b5,$95,$08,   $0b,$56,$b2,$00,
    $16,$2a,$da,$00,   $83,$49,$b6,$05,   $0e,$64,$bb,$00,   $19,$b2,$5b,$00,
    $87,$6a,$57,$04,   $12,$75,$2b,$00,   $1d,$b6,$95,$00,   $8a,$ad,$55,$02,
    $15,$55,$aa,$00,   $82,$55,$6c,$07,   $0d,$c9,$76,$00,   $17,$64,$b7,$00,
    $86,$e4,$ae,$05,   $11,$ea,$56,$00,   $1b,$6d,$2a,$00,   $88,$5a,$aa,$04,
    $14,$ad,$55,$00,   $81,$aa,$d5,$09,   $0b,$52,$ea,$00,   $16,$a9,$6d,$00,
    $84,$a9,$5d,$06,   $0f,$d4,$ae,$00,   $1a,$ea,$4d,$00,   $87,$ba,$55,$04,
    $12,$5a,$aa,$00,   $1d,$ab,$55,$00,   $8a,$a6,$d5,$02,   $14,$52,$da,$00,
    $82,$52,$ba,$06,   $0d,$a9,$3b,$00,   $18,$b4,$9b,$00,   $85,$74,$9b,$05,
    $11,$b5,$4d,$00,   $1c,$d6,$a9,$00,   $88,$35,$aa,$03,   $13,$a5,$b5,$00,
    $81,$a5,$75,$0b,   $0b,$52,$b6,$00,   $16,$69,$37,$00,   $84,$e9,$2f,$06,
    $10,$f4,$97,$00,   $1a,$75,$4b,$00,   $87,$6d,$52,$05,   $11,$2d,$69,$00,
    $1d,$95,$b5,$00,   $8a,$a5,$6d,$02,   $15,$d2,$6e,$00,   $82,$d2,$5e,$07,
    $0e,$e9,$2e,$00,   $19,$ea,$96,$00,   $86,$da,$95,$05,   $10,$5b,$4a,$00,
    $1c,$ab,$69,$00,   $88,$2a,$d8,$03);

  //数组gLanarHoliDay存放每年的二十四节气对应的阳历日期
  //每年的二十四节气对应的阳历日期几乎固定，平均分布于十二个月中
  //       1月                     2月                   3月                   4月                   5月                   6月
  //小寒   大寒       立春     雨水       惊蛰   春分       清明   谷雨       立夏   小满       芒种   夏至
  //       7月                     8月                   9月                   10月               11月                 12月
  //小暑   大暑       立秋     处暑       白露   秋分       寒露   霜降       立冬   小雪       大雪   冬至
  {***************************************************************************
  ******
    节气无任何确定规律,所以只好存表,要节省空间,所以....
  ****************************************************************************
  ******}
  //数据格式说明:
  //如1901年的节气为
  //     1月        2月        3月        4月        5月        6月        7月        8月        9月        10月       11月       12月
  //   6,   21,   4,   19,   6,   21,   5,   21,   6,   22,   6,   22,   8,   23,   8,   24,   8,   24,   8,   24,   8,   23,   8,   22
  //   9,   6,   11,   4,   9,   6,    10,   6,   9,   7,    9,   7,     7,   8,    7,   9,    7,    9,   7,    9,   7,   8,    7,   15
  //上面第一行数据为每月节气对应日期,15减去每月第一个节气,每月第二个节气减去15得第二行
  //这样每月两个节气对应数据都小于16,每月用一个字节存放,高位存放第一个节气数据,低位存放
  //第二个节气的数据,可得下表
  gLunarHolDay:array[0..1799]   of   Byte=(
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1901
        $96,   $A4,   $96,   $96,   $97,   $87,   $79,   $79,   $79,   $69,   $78,   $78,       //1902
        $96,   $A5,   $87,   $96,   $87,   $87,   $79,   $69,   $69,   $69,   $78,   $78,       //1903
        $86,   $A5,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $78,   $87,       //1904
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1905
        $96,   $A4,   $96,   $96,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1906
        $96,   $A5,   $87,   $96,   $87,   $87,   $79,   $69,   $69,   $69,   $78,   $78,       //1907
        $86,   $A5,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1908
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1909
        $96,   $A4,   $96,   $96,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1910
        $96,   $A5,   $87,   $96,   $87,   $87,   $79,   $69,   $69,   $69,   $78,   $78,       //1911
        $86,   $A5,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1912
        $95,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1913
        $96,   $B4,   $96,   $A6,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1914
        $96,   $A5,   $97,   $96,   $97,   $87,   $79,   $79,   $69,   $69,   $78,   $78,       //1915
        $96,   $A5,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1916
        $95,   $B4,   $96,   $A6,   $96,   $97,   $78,   $79,   $78,   $69,   $78,   $87,       //1917
        $96,   $B4,   $96,   $A6,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $77,       //1918
        $96,   $A5,   $97,   $96,   $97,   $87,   $79,   $79,   $69,   $69,   $78,   $78,       //1919
        $96,   $A5,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1920
        $95,   $B4,   $96,   $A5,   $96,   $97,   $78,   $79,   $78,   $69,   $78,   $87,       //1921
        $96,   $B4,   $96,   $A6,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $77,       //1922
        $96,   $A4,   $96,   $96,   $97,   $87,   $79,   $79,   $69,   $69,   $78,   $78,       //1923
        $96,   $A5,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1924
        $95,   $B4,   $96,   $A5,   $96,   $97,   $78,   $79,   $78,   $69,   $78,   $87,       //1925
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1926
        $96,   $A4,   $96,   $96,   $97,   $87,   $79,   $79,   $79,   $69,   $78,   $78,       //1927
        $96,   $A5,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1928
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1929
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1930
        $96,   $A4,   $96,   $96,   $97,   $87,   $79,   $79,   $79,   $69,   $78,   $78,       //1931
        $96,   $A5,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1932
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1933
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1934
        $96,   $A4,   $96,   $96,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1935
        $96,   $A5,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1936
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1937
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1938
        $96,   $A4,   $96,   $96,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1939
        $96,   $A5,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1940
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1941
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1942
        $96,   $A4,   $96,   $96,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1943
        $96,   $A5,   $96,   $A5,   $A6,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1944
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1945
        $95,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $78,   $69,   $78,   $77,       //1946
        $96,   $B4,   $96,   $A6,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1947
        $96,   $A5,   $A6,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //1948
        $A5,   $B4,   $96,   $A5,   $96,   $97,   $88,   $79,   $78,   $79,   $77,   $87,       //1949
        $95,   $B4,   $96,   $A5,   $96,   $97,   $78,   $79,   $78,   $69,   $78,   $77,       //1950
        $96,   $B4,   $96,   $A6,   $97,   $97,   $79,   $79,   $79,   $69,   $78,   $78,       //1951
        $96,   $A5,   $A6,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //1952
        $A5,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1953
        $95,   $B4,   $96,   $A5,   $96,   $97,   $78,   $79,   $78,   $68,   $78,   $87,       //1954
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1955
        $96,   $A5,   $A5,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //1956
        $A5,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1957
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1958
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1959
        $96,   $A4,   $A5,   $A5,   $A6,   $96,   $88,   $88,   $88,   $78,   $87,   $87,       //1960
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1961
        $96,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1962
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1963
        $96,   $A4,   $A5,   $A5,   $A6,   $96,   $88,   $88,   $88,   $78,   $87,   $87,       //1964
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1965
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1966
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1967
        $96,   $A4,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //1968
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1969
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1970
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $79,   $69,   $78,   $77,       //1971
        $96,   $A4,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //1972
        $A5,   $B5,   $96,   $A5,   $A6,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1973
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1974
        $96,   $B4,   $96,   $A6,   $97,   $97,   $78,   $79,   $78,   $69,   $78,   $77,       //1975
        $96,   $A4,   $A5,   $B5,   $A6,   $A6,   $88,   $89,   $88,   $78,   $87,   $87,       //1976
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //1977
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $78,   $87,       //1978
        $96,   $B4,   $96,   $A6,   $96,   $97,   $78,   $79,   $78,   $69,   $78,   $77,       //1979
        $96,   $A4,   $A5,   $B5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //1980
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $77,   $87,       //1981
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1982
        $95,   $B4,   $96,   $A5,   $96,   $97,   $78,   $79,   $78,   $69,   $78,   $77,       //1983
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $87,       //1984
        $A5,   $B4,   $A6,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //1985
        $A5,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //1986
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $79,   $78,   $69,   $78,   $87,       //1987
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //1988
        $A5,   $B4,   $A5,   $A5,   $A6,   $96,   $88,   $88,   $88,   $78,   $87,   $87,       //1989
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $79,   $77,   $87,       //1990
        $95,   $B4,   $96,   $A5,   $86,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1991
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //1992
        $A5,   $B3,   $A5,   $A5,   $A6,   $96,   $88,   $88,   $88,   $78,   $87,   $87,       //1993
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1994
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $76,   $78,   $69,   $78,   $87,       //1995
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //1996
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //1997
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //1998
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //1999
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //2000
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2001
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //2002
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //2003
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //2004
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2005
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2006
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $69,   $78,   $87,       //2007
        $96,   $B4,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $87,   $78,   $87,   $86,       //2008
        $A5,   $B3,   $A5,   $B5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2009
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2010
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $78,   $87,       //2011
        $96,   $B4,   $A5,   $B5,   $A5,   $A6,   $87,   $88,   $87,   $78,   $87,   $86,       //2012
        $A5,   $B3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $87,       //2013
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2014
        $95,   $B4,   $96,   $A5,   $96,   $97,   $88,   $78,   $78,   $79,   $77,   $87,       //2015
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $87,   $88,   $87,   $78,   $87,   $86,       //2016
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $87,       //2017
        $A5,   $B4,   $A6,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2018
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $79,   $77,   $87,       //2019
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $86,       //2020
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //2021
        $A5,   $B4,   $A5,   $A5,   $A6,   $96,   $88,   $88,   $88,   $78,   $87,   $87,       //2022
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $79,   $77,   $87,       //2023
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $96,       //2024
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //2025
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2026
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //2027
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $96,       //2028
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //2029
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2030
        $A5,   $B4,   $96,   $A5,   $96,   $96,   $88,   $78,   $78,   $78,   $87,   $87,       //2031
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $96,       //2032
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $86,       //2033
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $78,   $88,   $78,   $87,   $87,       //2034
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2035
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $96,       //2036
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $86,       //2037
        $A5,   $B3,   $A5,   $A5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2038
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2039
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $96,       //2040
        $A5,   $C3,   $A5,   $B5,   $A5,   $A6,   $87,   $88,   $87,   $78,   $87,   $86,       //2041
        $A5,   $B3,   $A5,   $B5,   $A6,   $A6,   $88,   $88,   $88,   $78,   $87,   $87,       //2042
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2043
        $95,   $B4,   $A5,   $B4,   $A5,   $A6,   $97,   $87,   $87,   $88,   $87,   $96,       //2044
        $A5,   $C3,   $A5,   $B4,   $A5,   $A6,   $87,   $88,   $87,   $78,   $87,   $86,       //2045
        $A5,   $B3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $88,   $78,   $87,   $87,       //2046
        $A5,   $B4,   $96,   $A5,   $A6,   $96,   $88,   $88,   $78,   $78,   $87,   $87,       //2047
        $95,   $B4,   $A5,   $B4,   $A5,   $A5,   $97,   $87,   $87,   $88,   $86,   $96,       //2048
        $A4,   $C3,   $A5,   $A5,   $A5,   $A6,   $97,   $87,   $87,   $78,   $87,   $86,       //2049
        $A5,   $C3,   $A5,   $B5,   $A6,   $A6,   $87,   $88,   $78,   $78,   $87,   $87);     //2050

  function CnMonthOfDate(Date: TDate): String;//指定日期的农历月
  function CnDayOfDate(Date: TDate): String;//指定日期的农历日
  function CnDateOfDateStr(Date: TDate): String;//指定日期的农历日期

  function Holiday(Date: TDateTime): string;
  function CnDayOfDateJr(Date: TDateTime): string;
  function OtherHoliday(Date: TDateTime): string;

  function   GetLunarHolDay(InDate:TDateTime):string;overload;
  function   GetLunarHolDay(iYear,iMonth,iDay:Word):string;overload;

  //计算公历iYear年iMonth月iDay日对应的节气   0-24，0表不是节气
  function   l_GetLunarHolDay(iYear,iMonth,iDay:Word):Word;

implementation

//日期是该年的第几天，1月1日为第一天
function DaysNumberOfDate(Date: TDate): Integer;
var
  DaysNumber: Integer;
  I: Integer;
  yyyy, mm, dd: Word;
begin
  DecodeDate(Date, yyyy, mm, dd);
  DaysNumber := 0;
  for I := 1 to mm - 1 do
    Inc(DaysNumber, MonthDays[IsLeapYear(yyyy), I]);
  Inc(DaysNumber, dd);
  Result := DaysNumber;
end;

//日期的农历日期，返回农历格式：月份*100 + 日，负数为闰月
//超出范围则返回0
function CnDateOfDate(Date: TDate): Integer;
var
  CnMonth, CnMonthDays: array[0..15] of Integer;

  CnBeginDay, LeapMonth: Integer;
  yyyy, mm, dd: Word;
  Bytes: array[0..3] of Byte;
  I: Integer;
  CnMonthData: Word;
  DaysCount, CnDaysCount, ResultMonth, ResultDay: Integer;
begin
  DecodeDate(Date, yyyy, mm, dd);
  if (yyyy < 1901) or (yyyy > 2050) then
  begin
    Result := 0;
    Exit;
  end;
  Bytes[0] := CnData[(yyyy - 1901) * 4];
  Bytes[1] := CnData[(yyyy - 1901) * 4 + 1];
  Bytes[2] := CnData[(yyyy - 1901) * 4 + 2];
  Bytes[3] := CnData[(yyyy - 1901) * 4 + 3];
  if (Bytes[0] and $80) <> 0 then CnMonth[0] := 12
  else CnMonth[0] := 11;
  CnBeginDay := (Bytes[0] and $7f);
  CnMonthData := Bytes[1];
  CnMonthData := CnMonthData shl 8;
  CnMonthData := CnMonthData or Bytes[2];
  LeapMonth := Bytes[3];

  for I := 15 downto 0 do
  begin
    CnMonthDays[15 - I] := 29;
    if ((1 shl I) and CnMonthData) <> 0 then
      Inc(CnMonthDays[15 - I]);
    if CnMonth[15 - I] = LeapMonth then
      CnMonth[15 - I + 1] := - LeapMonth
    else
    begin
      if CnMonth[15 - I] < 0 then //上月为闰月
        CnMonth[15 - I + 1] := - CnMonth[15 - I] + 1
      else CnMonth[15 - I + 1] := CnMonth[15 - I] + 1;
      if CnMonth[15 - I + 1] > 12 then CnMonth[15 - I + 1] := 1;
    end;
  end;

  DaysCount := DaysNumberOfDate(Date) - 1;
  if DaysCount <= (CnMonthDays[0] - CnBeginDay) then
  begin
    if (yyyy > 1901) and
      (CnDateOfDate(EncodeDate(yyyy - 1, 12, 31)) < 0) then
      ResultMonth := - CnMonth[0]
    else ResultMonth := CnMonth[0];
    ResultDay := CnBeginDay + DaysCount;
  end
  else
  begin
    CnDaysCount := CnMonthDays[0] - CnBeginDay;
    I := 1;
    while (CnDaysCount < DaysCount) and
      (CnDaysCount + CnMonthDays[I] < DaysCount) do
    begin
      Inc(CnDaysCount, CnMonthDays[I]);
      Inc(I);
    end;
    ResultMonth := CnMonth[I];
    ResultDay := DaysCount - CnDaysCount;
  end;
  if ResultMonth > 0 then
    Result := ResultMonth * 100 + ResultDay
  else Result := ResultMonth * 100 - ResultDay
end;

function CnMonthOfDate(Date: TDate): String;
const
  CnMonthStr: array[1..12] of String = (
    '正', '二', '三', '四', '五', '六', '七', '八', '九', '十',
    '冬', '蜡');
var
  Month: Integer;
begin
  Month := CnDateOfDate(Date) div 100;
  if Month < 0 then Result := '闰' + CnMonthStr[-Month]
  else if Month=0 then Result :=''
  else Result := CnMonthStr[Month] + '月';
end;

function CnDayOfDate(Date: TDate): String;
const
  CnDayStr: array[1..30] of String = (
    '初一', '初二', '初三', '初四', '初五',
    '初六', '初七', '初八', '初九', '初十',
    '十一', '十二', '十三', '十四', '十五',
    '十六', '十七', '十八', '十九', '二十',
    '廿一', '廿二', '廿三', '廿四', '廿五',
    '廿六', '廿七', '廿八', '廿九', '三十');
var
  Day: Integer;
begin
  if CnDateOfDate(Date) = 0 then
  begin
    Result := '';
    Exit;
  end;
  Day := Abs(CnDateOfDate(Date)) mod 100;
  Result := CnDayStr[Day];
end;

function CnDateOfDateStr(Date: TDate): String;
begin
  Result := CnMonthOfDate(Date) + CnDayOfDate(Date);
end;

function Holiday(Date: TDateTime): string;
var
  year,month,day: Word;
begin
  result := '';
  DecodeDate(Date, year, month, day);

  case month of
    1:
      begin
        if day = 1 then
          result := '元旦节';
      end;

    2:
      begin
        if day = 14 then
          result := '情人节';
      end;
    3:
      begin
        if day = 8 then
          result := '妇女节';
      end;
    4:
      begin
        if day = 1 then
          result := '愚人节';
      end;
    5:
      begin
        if day = 1 then
          result := '劳动节';

        if day = 4 then
          result := '青年节';

        // 母亲节[第二个星期日]
        if (DayOfWeek(Date) = 1) then
          if (Trunc((day - 1) / 7) = 1) then
            result := '母亲节';

      end;
    6:
      begin
        if day = 1 then
          result := '儿童节';

        // 父亲节[第三个星期日]
        if (DayOfWeek(Date) = 1) then
          if (Trunc((day - 1) / 7) = 2) then
            result := '父亲节';
      end;
    7:
      begin
        if day = 1 then
          result := '建党节';
      end;
    8:
      begin
        if day = 1 then
          result := '建军节';

      end;
    9:
      begin
        if day = 10 then
          result := '教师节';
      end;
    10:
      begin
        if day = 1 then
          result := '国庆节';

        if day = 6 then
          result := '老人节';

        if day = 31 then
          result := '万圣节';

      end;

    11:
      begin
        if day = 8 then
          result := '记者日';

        // 感恩节(11月的第四个星期四 )
        if (DayOfWeek(Date) = 5) then
          if (Trunc((day - 1) / 7) = 3) then
            result := '感恩节';

      end;
    12:
      begin
        if day = 25 then
          result := '圣诞节';
      end;

  end;
end;

function CnDayOfDateJr(Date: TDateTime): string;
var
  Day: Integer;
begin
  Result := '';
  Day := Abs(CnDateOfDate(Date)) mod 100;
  case Day of
    1:
      if (CnMonthOfDate(Date) = '正月') then
        Result := '春节';
    5:
      if CnMonthOfDate(Date) = '五月' then
        Result := '端午节';
    7:
      if CnMonthOfDate(Date) = '七月' then
        Result := '七夕节';
    15:
      if CnMonthOfDate(Date) = '八月' then
        Result := '中秋节'
      else
        if (CnMonthOfDate(Date) = '正月') then
          Result := '元宵节';
    9:
      if CnMonthOfDate(Date) = '九月' then
        Result := '重阳节';
    8:
      if CnMonthOfDate(Date) = '腊月' then
        Result := '腊八节';
  else
    if (CnMonthOfDate(Date + 1) = '正月') and (CnMonthOfDate(Date) <> '正月') then
      Result := '除夕';
  end; {case}
end;

function OtherHoliday(Date: TDateTime): string;
var
  year,month,day: Word;
begin
  //五月的第二个星期日庆祝母亲节
  //將每年6月的第3個星期天定為父親節      ?
  {

  新年元旦[01/01] 腊八节[农历十二月初八]


   世界湿地日[02/02] 国际气象节[02/10] 情人节[02/14]
  除夕[农历十二月三十] 春节[农历正月初一] 元宵节[农历正月十五]


   全国爱耳日[03/03] 妇女节[03/08] 植树节[03/12]
  国际警察日[03/14] 国际消费日[03/15] 世界森林日[03/21]
  世界水日[03/22] 世界气象日[03/23] 世界防治结核病日[03/24]


   愚人节[04/01] 清明[04/05] 世界卫生日[04/07]
  世界地球日[04/22]


   国际劳动节[05/01] 中国青年节[05/04] 全国碘缺乏病日[05/05]
  世界红十字日[05/08] 国际护士节[05/12] 国际家庭日[05/15]
  世界电信日[05/17] 国际博物馆日[05/18] 全国助残日[05/19]
  全国学生营养日[05/20] 国际生物多样性日[05/22] 国际牛奶日[05/23]
  世界无烟日[05/31] 端午节[农历五月初五] 母亲节[第二个星期日]


   国际儿童节[06/01] 世界环境日[06/05] 全国爱眼日[06/06]
  端午节[06/15] 父亲节[第三个星期日] 防治荒漠化和干旱日[06/17]
  国际奥林匹克日[06/23] 全国土地日[06/25] 国际反毒品日[06/26]


   香港回归日[07/01] 七夕情人节[农历七月初七] 建党日[07/01]　
  中国人民抗日战争纪念日[07/07] 世界人口日[07/11]　


   八一建军节[08/01]　　


   劳动节[09/02]　 国际扫盲日[09/08] 教师节[09/10]
  国际臭氧层保护日[09/16] 国际和平日[09/17] 国际爱牙日[09/20]
  中秋节[农历八月十五] 国际聋人节[09/22] 世界旅游日[09/27]
  重阳节[农历九月九日]


   国庆节[10/01]　 国际音乐节[10/01] 国际减轻自然灾害日[10/02]
  世界动物日[10/04] 国际住房日[10/07] 全国高血压日[10/08]
  世界视觉日[10/08] 世界邮政日[10/09] 世界精神卫生日[10/10]
  国际盲人节[10/15] 世界粮食节[10/16] 世界消除贫困日[10/17]
  世界传统医药日[10/22] 联合国日[10/24] 万圣节[10/31]



   中国记者日[11/08]　 消防宣传日[11/09] 世界糖尿病日[11/14]
  国际大学生节[11/17] 感恩节[11/28]


   冬至节[农历12月22日] 世界艾滋病日[12/01] 世界残疾人日[12/03]
  世界足球日[12/09] 圣诞节[12/25]





  }
  result := '';
  DecodeDate(Date, year, month, day);

  case month of
    1:
      begin
      end;

    2:
      begin

        if day = 2 then
          result := '湿地日';

        if day = 10 then
          result := '气象节';

      end;
    3:
      begin
        if day = 3 then
          result := '爱耳日';


        if day = 12 then
          result := '植树节';

        if day = 14 then
          result := '警察日';

        if day = 15 then
          result := '消费节';

        if day = 21 then
          result := '森林日';

        if day = 22 then
          result := '水日';

        if day = 23 then
          result := '气象日';

      end;
    4:
      begin

        if day = 7 then
          result := '卫生日';

        if day = 22 then
          result := '地球日';

      end;
    5:
      begin
        if day = 8 then
          result := '红十字';

        if day = 12 then
          result := '护士节';

        if day = 15 then
          result := '家庭日';

        if day = 17 then
          result := '电信日';

        if day = 18 then
          result := '博物馆';

        if day = 19 then
          result := '助残日';

        if day = 23 then
          result := '牛奶日';

        if day = 31 then
          result := '无烟日';

        // 母亲节[第二个星期日]
      end;
    6:
      begin

        if day = 5 then
          result := '环境日';

        if day = 6 then
          result := '爱眼日';

        if day = 23 then
          result := '体育日';

        if day = 25 then
          result := '土地日';

        if day = 26 then
          result := '反毒品';

        // 父亲节[第三个星期日]
      end;
    7:
      begin

        if day = 11 then
          result := '人口日';

      end;
    8:
      begin

      end;
    9:
      begin
        if day = 8 then
          result := '扫盲日';


        if day = 17 then
          result := '和平日';

        if day = 20 then
          result := '爱牙日';

        if day = 22 then
          result := '聋人节';

        if day = 27 then
          result := '旅游日';

      end;
    10:
      begin

        if day = 6 then
          result := '老人节';

        if day = 4 then
          result := '动物日';

        if day = 7 then
          result := '住房日';

        if day = 9 then
          result := '邮政日';

        if day = 15 then
          result := '盲人节';

        if day = 16 then
          result := '粮食日';


      end;

    11:
      begin
        if day = 8 then
          result := '记者日';

        if day = 9 then
          result := '消防日';

        if day = 17 then
          result := '大学生';


      end;
    12:
      begin
        if day = 9 then
          result := '足球日';

        if day = 24 then
          result := '平安夜';
      end;

  end;
end;

function   l_GetLunarHolDay(iYear,iMonth,iDay:Word):Word;
var
    Flag:Byte;
    Day:Word;
begin
    Flag:=gLunarHolDay[(iYear-START_YEAR)*12+iMonth-1];
    if   iDay <15   then
        Day:=15-((Flag   shr   4)   and   $0f)
    else
        Day:=(Flag   and   $0f)+15;
    if   iDay=Day   then
        if   iDay> 15   then
            Result:=(iMonth-1)*2+2
        else
            Result:=(iMonth-1)*2+1
    else
        Result:=0;
end;

function   GetLunarHolDay(InDate:TDateTime):string;
var
    i,iYear,iMonth,iDay:Word;
begin
    DecodeDate(InDate,iYear,iMonth,iDay);
    i:=l_GetLunarHolDay(iYear,iMonth,iDay);
    case   i   of
        1:Result:= '小寒';
        2:Result:= '大寒';
        3:Result:= '立春';
        4:Result:= '雨水';
        5:Result:= '惊蛰';
        6:Result:= '春分';
        7:Result:= '清明';
        8:Result:= '谷雨';
        9:Result:= '立夏';
        10:Result:= '小满';
        11:Result:= '芒种';
        12:Result:= '夏至';
        13:Result:= '小暑';
        14:Result:= '大暑';
        15:Result:= '立秋';
        16:Result:= '处暑';
        17:Result:= '白露';
        18:Result:= '秋分';
        19:Result:= '寒露';
        20:Result:= '霜降';
        21:Result:= '立冬';
        22:Result:= '小雪';
        23:Result:= '大雪';
        24:Result:= '冬至';
    else
        Result:= '';
    end;
end;

function   GetLunarHolDay(iYear,iMonth,iDay:Word):string;
begin
    Result:=GetLunarHolDay(EncodeDate(iYear,iMonth,iDay));
end;

end.


